app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
---
      <% if signed_in? %>
      <p>Author: <%= User.find_by(id: post.user_id).name %></p>