app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "corpo do primeiro post"], ["created_at", "2014-11-13 22:41:57.352353"], ["title", "primeiro post"], ["updated_at", "2014-11-13 22:41:57.352353"], ["user_id", 3]]